zephyrproject-rtos/zephyr/ext/hal/ti/simplelink/source/ti/devices/msp432p4xx/inc/msp432p4111.h
#define LCD_F_PCTL1_S38_OFS                      ( 6)                            /*!< LCDS38 Bit Offset */
#define LCD_F_PCTL1_S38                          ((uint32_t)0x00000040)          /*!< LCD pin 38 enable */
/* LCD_F_PCTL1[S39] Bits */
#define LCD_F_PCTL1_S39_OFS                      ( 7)                            /*!< LCDS39 Bit Offset */
#define LCD_F_PCTL1_S39                          ((uint32_t)0x00000080)          /*!< LCD pin 39 enable */
/* LCD_F_PCTL1[S40] Bits */
#define LCD_F_PCTL1_S40_OFS                      ( 8)                            /*!< LCDS40 Bit Offset */
#define LCD_F_PCTL1_S40                          ((uint32_t)0x00000100)          /*!< LCD pin 40 enable */
/* LCD_F_PCTL1[S41] Bits */
#define LCD_F_PCTL1_S41_OFS                      ( 9)                            /*!< LCDS41 Bit Offset */
#define LCD_F_PCTL1_S41                          ((uint32_t)0x00000200)          /*!< LCD pin 41 enable */
/* LCD_F_PCTL1[S42] Bits */
#define LCD_F_PCTL1_S42_OFS                      (10)                            /*!< LCDS42 Bit Offset */
#define LCD_F_PCTL1_S42                          ((uint32_t)0x00000400)          /*!< LCD pin 42 enable */
/* LCD_F_PCTL1[S43] Bits */
#define LCD_F_PCTL1_S43_OFS                      (11)                            /*!< LCDS43 Bit Offset */
#define LCD_F_PCTL1_S43                          ((uint32_t)0x00000800)          /*!< LCD pin 43 enable */
/* LCD_F_PCTL1[S44] Bits */
#define LCD_F_PCTL1_S44_OFS                      (12)                            /*!< LCDS44 Bit Offset */
#define LCD_F_PCTL1_S44                          ((uint32_t)0x00001000)          /*!< LCD pin 44 enable */
/* LCD_F_PCTL1[S45] Bits */
#define LCD_F_PCTL1_S45_OFS                      (13)                            /*!< LCDS45 Bit Offset */
#define LCD_F_PCTL1_S45                          ((uint32_t)0x00002000)          /*!< LCD pin 45 enable */
/* LCD_F_PCTL1[S46] Bits */
#define LCD_F_PCTL1_S46_OFS                      (14)                            /*!< LCDS46 Bit Offset */
#define LCD_F_PCTL1_S46                          ((uint32_t)0x00004000)          /*!< LCD pin 46 enable */
/* LCD_F_PCTL1[S47] Bits */
#define LCD_F_PCTL1_S47_OFS                      (15)                            /*!< LCDS47 Bit Offset */
#define LCD_F_PCTL1_S47                          ((uint32_t)0x00008000)          /*!< LCD pin 47 enable */
/* LCD_F_PCTL1[S48] Bits */
#define LCD_F_PCTL1_S48_OFS                      (16)                            /*!< LCDS48 Bit Offset */
#define LCD_F_PCTL1_S48                          ((uint32_t)0x00010000)          /*!< LCD pin 48 enable */
/* LCD_F_PCTL1[S49] Bits */
#define LCD_F_PCTL1_S49_OFS                      (17)                            /*!< LCDS49 Bit Offset */
#define LCD_F_PCTL1_S49                          ((uint32_t)0x00020000)          /*!< LCD pin 49 enable */
/* LCD_F_PCTL1[S50] Bits */
#define LCD_F_PCTL1_S50_OFS                      (18)                            /*!< LCDS50 Bit Offset */
#define LCD_F_PCTL1_S50                          ((uint32_t)0x00040000)          /*!< LCD pin 50 enable */
/* LCD_F_PCTL1[S51] Bits */
#define LCD_F_PCTL1_S51_OFS                      (19)                            /*!< LCDS51 Bit Offset */
#define LCD_F_PCTL1_S51                          ((uint32_t)0x00080000)          /*!< LCD pin 51 enable */
/* LCD_F_PCTL1[S52] Bits */
#define LCD_F_PCTL1_S52_OFS                      (20)                            /*!< LCDS52 Bit Offset */
#define LCD_F_PCTL1_S52                          ((uint32_t)0x00100000)          /*!< LCD pin 52 enable */
/* LCD_F_PCTL1[S53] Bits */
#define LCD_F_PCTL1_S53_OFS                      (21)                            /*!< LCDS53 Bit Offset */
#define LCD_F_PCTL1_S53                          ((uint32_t)0x00200000)          /*!< LCD pin 53 enable */
/* LCD_F_PCTL1[S54] Bits */
#define LCD_F_PCTL1_S54_OFS                      (22)                            /*!< LCDS54 Bit Offset */
#define LCD_F_PCTL1_S54                          ((uint32_t)0x00400000)          /*!< LCD pin 54 enable */
/* LCD_F_PCTL1[S55] Bits */
#define LCD_F_PCTL1_S55_OFS                      (23)                            /*!< LCDS55 Bit Offset */
#define LCD_F_PCTL1_S55                          ((uint32_t)0x00800000)          /*!< LCD pin 55 enable */
/* LCD_F_PCTL1[S56] Bits */
#define LCD_F_PCTL1_S56_OFS                      (24)                            /*!< LCDS56 Bit Offset */
#define LCD_F_PCTL1_S56                          ((uint32_t)0x01000000)          /*!< LCD pin 56 enable */
/* LCD_F_PCTL1[S57] Bits */
#define LCD_F_PCTL1_S57_OFS                      (25)                            /*!< LCDS57 Bit Offset */
#define LCD_F_PCTL1_S57                          ((uint32_t)0x02000000)          /*!< LCD pin 57 enable */
/* LCD_F_PCTL1[S58] Bits */
#define LCD_F_PCTL1_S58_OFS                      (26)                            /*!< LCDS58 Bit Offset */
#define LCD_F_PCTL1_S58                          ((uint32_t)0x04000000)          /*!< LCD pin 58 enable */
/* LCD_F_PCTL1[S59] Bits */
#define LCD_F_PCTL1_S59_OFS                      (27)                            /*!< LCDS59 Bit Offset */
#define LCD_F_PCTL1_S59                          ((uint32_t)0x08000000)          /*!< LCD pin 59 enable */
/* LCD_F_PCTL1[S60] Bits */
#define LCD_F_PCTL1_S60_OFS                      (28)                            /*!< LCDS60 Bit Offset */
#define LCD_F_PCTL1_S60                          ((uint32_t)0x10000000)          /*!< LCD pin 60 enable */
/* LCD_F_PCTL1[S61] Bits */
#define LCD_F_PCTL1_S61_OFS                      (29)                            /*!< LCDS61 Bit Offset */
#define LCD_F_PCTL1_S61                          ((uint32_t)0x20000000)          /*!< LCD pin 61 enable */
/* LCD_F_PCTL1[S62] Bits */
#define LCD_F_PCTL1_S62_OFS                      (30)                            /*!< LCDS62 Bit Offset */
#define LCD_F_PCTL1_S62                          ((uint32_t)0x40000000)          /*!< LCD pin 62 enable */
/* LCD_F_PCTL1[S63] Bits */
#define LCD_F_PCTL1_S63_OFS                      (31)                            /*!< LCDS63 Bit Offset */
#define LCD_F_PCTL1_S63                          ((uint32_t)0x80000000)          /*!< LCD pin 63 enable */
/* LCD_F_CSSEL0[CSS0] Bits */
#define LCD_F_CSSEL0_CSS0_OFS                    ( 0)                            /*!< LCDCSS0 Bit Offset */
#define LCD_F_CSSEL0_CSS0                        ((uint32_t)0x00000001)          /*!< L0 Com Seg select */
/* LCD_F_CSSEL0[CSS1] Bits */
#define LCD_F_CSSEL0_CSS1_OFS                    ( 1)                            /*!< LCDCSS1 Bit Offset */
#define LCD_F_CSSEL0_CSS1                        ((uint32_t)0x00000002)          /*!< L1 Com Seg select */
/* LCD_F_CSSEL0[CSS2] Bits */
#define LCD_F_CSSEL0_CSS2_OFS                    ( 2)                            /*!< LCDCSS2 Bit Offset */
#define LCD_F_CSSEL0_CSS2                        ((uint32_t)0x00000004)          /*!< L2 Com Seg select */
/* LCD_F_CSSEL0[CSS3] Bits */
#define LCD_F_CSSEL0_CSS3_OFS                    ( 3)                            /*!< LCDCSS3 Bit Offset */
#define LCD_F_CSSEL0_CSS3                        ((uint32_t)0x00000008)          /*!< L3 Com Seg select */
/* LCD_F_CSSEL0[CSS4] Bits */
#define LCD_F_CSSEL0_CSS4_OFS                    ( 4)                            /*!< LCDCSS4 Bit Offset */
#define LCD_F_CSSEL0_CSS4                        ((uint32_t)0x00000010)          /*!< L4 Com Seg select */
/* LCD_F_CSSEL0[CSS5] Bits */
#define LCD_F_CSSEL0_CSS5_OFS                    ( 5)                            /*!< LCDCSS5 Bit Offset */
#define LCD_F_CSSEL0_CSS5                        ((uint32_t)0x00000020)          /*!< L5 Com Seg select */
/* LCD_F_CSSEL0[CSS6] Bits */
#define LCD_F_CSSEL0_CSS6_OFS                    ( 6)                            /*!< LCDCSS6 Bit Offset */
#define LCD_F_CSSEL0_CSS6                        ((uint32_t)0x00000040)          /*!< L6 Com Seg select */
/* LCD_F_CSSEL0[CSS7] Bits */
#define LCD_F_CSSEL0_CSS7_OFS                    ( 7)                            /*!< LCDCSS7 Bit Offset */
#define LCD_F_CSSEL0_CSS7                        ((uint32_t)0x00000080)          /*!< L7 Com Seg select */
/* LCD_F_CSSEL0[CSS8] Bits */
#define LCD_F_CSSEL0_CSS8_OFS                    ( 8)                            /*!< LCDCSS8 Bit Offset */
#define LCD_F_CSSEL0_CSS8                        ((uint32_t)0x00000100)          /*!< L8 Com Seg select */
/* LCD_F_CSSEL0[CSS9] Bits */
#define LCD_F_CSSEL0_CSS9_OFS                    ( 9)                            /*!< LCDCSS9 Bit Offset */
#define LCD_F_CSSEL0_CSS9                        ((uint32_t)0x00000200)          /*!< L9 Com Seg select */
/* LCD_F_CSSEL0[CSS10] Bits */
#define LCD_F_CSSEL0_CSS10_OFS                   (10)                            /*!< LCDCSS10 Bit Offset */
#define LCD_F_CSSEL0_CSS10                       ((uint32_t)0x00000400)          /*!< L10 Com Seg select */
/* LCD_F_CSSEL0[CSS11] Bits */
#define LCD_F_CSSEL0_CSS11_OFS                   (11)                            /*!< LCDCSS11 Bit Offset */
#define LCD_F_CSSEL0_CSS11                       ((uint32_t)0x00000800)          /*!< L11 Com Seg select */
/* LCD_F_CSSEL0[CSS12] Bits */
#define LCD_F_CSSEL0_CSS12_OFS                   (12)                            /*!< LCDCSS12 Bit Offset */
#define LCD_F_CSSEL0_CSS12                       ((uint32_t)0x00001000)          /*!< L12 Com Seg select */
/* LCD_F_CSSEL0[CSS13] Bits */
#define LCD_F_CSSEL0_CSS13_OFS                   (13)                            /*!< LCDCSS13 Bit Offset */
#define LCD_F_CSSEL0_CSS13                       ((uint32_t)0x00002000)          /*!< L13 Com Seg select */
/* LCD_F_CSSEL0[CSS14] Bits */
#define LCD_F_CSSEL0_CSS14_OFS                   (14)                            /*!< LCDCSS14 Bit Offset */
#define LCD_F_CSSEL0_CSS14                       ((uint32_t)0x00004000)          /*!< L14 Com Seg select */
/* LCD_F_CSSEL0[CSS15] Bits */
#define LCD_F_CSSEL0_CSS15_OFS                   (15)                            /*!< LCDCSS15 Bit Offset */
#define LCD_F_CSSEL0_CSS15                       ((uint32_t)0x00008000)          /*!< L15 Com Seg select */
/* LCD_F_CSSEL0[CSS16] Bits */
#define LCD_F_CSSEL0_CSS16_OFS                   (16)                            /*!< LCDCSS16 Bit Offset */
#define LCD_F_CSSEL0_CSS16                       ((uint32_t)0x00010000)          /*!< L16 Com Seg select */
/* LCD_F_CSSEL0[CSS17] Bits */
#define LCD_F_CSSEL0_CSS17_OFS                   (17)                            /*!< LCDCSS17 Bit Offset */
#define LCD_F_CSSEL0_CSS17                       ((uint32_t)0x00020000)          /*!< L17 Com Seg select */
/* LCD_F_CSSEL0[CSS18] Bits */
#define LCD_F_CSSEL0_CSS18_OFS                   (18)                            /*!< LCDCSS18 Bit Offset */
#define LCD_F_CSSEL0_CSS18                       ((uint32_t)0x00040000)          /*!< L18 Com Seg select */
/* LCD_F_CSSEL0[CSS19] Bits */
#define LCD_F_CSSEL0_CSS19_OFS                   (19)                            /*!< LCDCSS19 Bit Offset */
#define LCD_F_CSSEL0_CSS19                       ((uint32_t)0x00080000)          /*!< L19 Com Seg select */
/* LCD_F_CSSEL0[CSS20] Bits */
#define LCD_F_CSSEL0_CSS20_OFS                   (20)                            /*!< LCDCSS20 Bit Offset */
#define LCD_F_CSSEL0_CSS20                       ((uint32_t)0x00100000)          /*!< L20 Com Seg select */
/* LCD_F_CSSEL0[CSS21] Bits */
#define LCD_F_CSSEL0_CSS21_OFS                   (21)                            /*!< LCDCSS21 Bit Offset */
#define LCD_F_CSSEL0_CSS21                       ((uint32_t)0x00200000)          /*!< L21 Com Seg select */
/* LCD_F_CSSEL0[CSS22] Bits */
#define LCD_F_CSSEL0_CSS22_OFS                   (22)                            /*!< LCDCSS22 Bit Offset */
#define LCD_F_CSSEL0_CSS22                       ((uint32_t)0x00400000)          /*!< L22 Com Seg select */
/* LCD_F_CSSEL0[CSS23] Bits */
#define LCD_F_CSSEL0_CSS23_OFS                   (23)                            /*!< LCDCSS23 Bit Offset */
#define LCD_F_CSSEL0_CSS23                       ((uint32_t)0x00800000)          /*!< L23 Com Seg select */
/* LCD_F_CSSEL0[CSS24] Bits */
#define LCD_F_CSSEL0_CSS24_OFS                   (24)                            /*!< LCDCSS24 Bit Offset */
#define LCD_F_CSSEL0_CSS24                       ((uint32_t)0x01000000)          /*!< L24 Com Seg select */
/* LCD_F_CSSEL0[CSS25] Bits */
#define LCD_F_CSSEL0_CSS25_OFS                   (25)                            /*!< LCDCSS25 Bit Offset */
#define LCD_F_CSSEL0_CSS25                       ((uint32_t)0x02000000)          /*!< L25 Com Seg select */
/* LCD_F_CSSEL0[CSS26] Bits */
#define LCD_F_CSSEL0_CSS26_OFS                   (26)                            /*!< LCDCSS26 Bit Offset */
#define LCD_F_CSSEL0_CSS26                       ((uint32_t)0x04000000)          /*!< L26 Com Seg select */
/* LCD_F_CSSEL0[CSS27] Bits */
#define LCD_F_CSSEL0_CSS27_OFS                   (27)                            /*!< LCDCSS27 Bit Offset */
#define LCD_F_CSSEL0_CSS27                       ((uint32_t)0x08000000)          /*!< L27 Com Seg select */
/* LCD_F_CSSEL0[CSS28] Bits */
#define LCD_F_CSSEL0_CSS28_OFS                   (28)                            /*!< LCDCSS28 Bit Offset */
#define LCD_F_CSSEL0_CSS28                       ((uint32_t)0x10000000)          /*!< L28 Com Seg select */
/* LCD_F_CSSEL0[CSS29] Bits */
#define LCD_F_CSSEL0_CSS29_OFS                   (29)                            /*!< LCDCSS29 Bit Offset */
#define LCD_F_CSSEL0_CSS29                       ((uint32_t)0x20000000)          /*!< L29 Com Seg select */
/* LCD_F_CSSEL0[CSS30] Bits */
#define LCD_F_CSSEL0_CSS30_OFS                   (30)                            /*!< LCDCSS30 Bit Offset */
#define LCD_F_CSSEL0_CSS30                       ((uint32_t)0x40000000)          /*!< L30 Com Seg select */
/* LCD_F_CSSEL0[CSS31] Bits */
#define LCD_F_CSSEL0_CSS31_OFS                   (31)                            /*!< LCDCSS31 Bit Offset */
#define LCD_F_CSSEL0_CSS31                       ((uint32_t)0x80000000)          /*!< L31 Com Seg select */
/* LCD_F_CSSEL1[CSS32] Bits */
#define LCD_F_CSSEL1_CSS32_OFS                   ( 0)                            /*!< LCDCSS32 Bit Offset */
#define LCD_F_CSSEL1_CSS32                       ((uint32_t)0x00000001)          /*!< L32 Com Seg select */
/* LCD_F_CSSEL1[CSS33] Bits */
#define LCD_F_CSSEL1_CSS33_OFS                   ( 1)                            /*!< LCDCSS33 Bit Offset */
#define LCD_F_CSSEL1_CSS33                       ((uint32_t)0x00000002)          /*!< L33 Com Seg select */
/* LCD_F_CSSEL1[CSS34] Bits */
#define LCD_F_CSSEL1_CSS34_OFS                   ( 2)                            /*!< LCDCSS34 Bit Offset */
#define LCD_F_CSSEL1_CSS34                       ((uint32_t)0x00000004)          /*!< L34 Com Seg select */
/* LCD_F_CSSEL1[CSS35] Bits */
#define LCD_F_CSSEL1_CSS35_OFS                   ( 3)                            /*!< LCDCSS35 Bit Offset */
#define LCD_F_CSSEL1_CSS35                       ((uint32_t)0x00000008)          /*!< L35 Com Seg select */
/* LCD_F_CSSEL1[CSS36] Bits */
#define LCD_F_CSSEL1_CSS36_OFS                   ( 4)                            /*!< LCDCSS36 Bit Offset */
#define LCD_F_CSSEL1_CSS36                       ((uint32_t)0x00000010)          /*!< L36 Com Seg select */
/* LCD_F_CSSEL1[CSS37] Bits */
#define LCD_F_CSSEL1_CSS37_OFS                   ( 5)                            /*!< LCDCSS37 Bit Offset */
#define LCD_F_CSSEL1_CSS37                       ((uint32_t)0x00000020)          /*!< L37 Com Seg select */
/* LCD_F_CSSEL1[CSS38] Bits */
#define LCD_F_CSSEL1_CSS38_OFS                   ( 6)                            /*!< LCDCSS38 Bit Offset */
#define LCD_F_CSSEL1_CSS38                       ((uint32_t)0x00000040)          /*!< L38 Com Seg select */
/* LCD_F_CSSEL1[CSS39] Bits */
#define LCD_F_CSSEL1_CSS39_OFS                   ( 7)                            /*!< LCDCSS39 Bit Offset */
#define LCD_F_CSSEL1_CSS39                       ((uint32_t)0x00000080)          /*!< L39 Com Seg select */
/* LCD_F_CSSEL1[CSS40] Bits */
#define LCD_F_CSSEL1_CSS40_OFS                   ( 8)                            /*!< LCDCSS40 Bit Offset */
#define LCD_F_CSSEL1_CSS40                       ((uint32_t)0x00000100)          /*!< L40 Com Seg select */
/* LCD_F_CSSEL1[CSS41] Bits */
#define LCD_F_CSSEL1_CSS41_OFS                   ( 9)                            /*!< LCDCSS41 Bit Offset */
#define LCD_F_CSSEL1_CSS41                       ((uint32_t)0x00000200)          /*!< L41 Com Seg select */
/* LCD_F_CSSEL1[CSS42] Bits */
#define LCD_F_CSSEL1_CSS42_OFS                   (10)                            /*!< LCDCSS42 Bit Offset */
#define LCD_F_CSSEL1_CSS42                       ((uint32_t)0x00000400)          /*!< L42 Com Seg select */
/* LCD_F_CSSEL1[CSS43] Bits */
#define LCD_F_CSSEL1_CSS43_OFS                   (11)                            /*!< LCDCSS43 Bit Offset */
#define LCD_F_CSSEL1_CSS43                       ((uint32_t)0x00000800)          /*!< L43 Com Seg select */
/* LCD_F_CSSEL1[CSS44] Bits */
#define LCD_F_CSSEL1_CSS44_OFS                   (12)                            /*!< LCDCSS44 Bit Offset */
#define LCD_F_CSSEL1_CSS44                       ((uint32_t)0x00001000)          /*!< L44 Com Seg select */
/* LCD_F_CSSEL1[CSS45] Bits */
#define LCD_F_CSSEL1_CSS45_OFS                   (13)                            /*!< LCDCSS45 Bit Offset */
#define LCD_F_CSSEL1_CSS45                       ((uint32_t)0x00002000)          /*!< L45 Com Seg select */
/* LCD_F_CSSEL1[CSS46] Bits */
#define LCD_F_CSSEL1_CSS46_OFS                   (14)                            /*!< LCDCSS46 Bit Offset */
#define LCD_F_CSSEL1_CSS46                       ((uint32_t)0x00004000)          /*!< L46 Com Seg select */
/* LCD_F_CSSEL1[CSS47] Bits */
#define LCD_F_CSSEL1_CSS47_OFS                   (15)                            /*!< LCDCSS47 Bit Offset */
#define LCD_F_CSSEL1_CSS47                       ((uint32_t)0x00008000)          /*!< L47 Com Seg select */
/* LCD_F_CSSEL1[CSS48] Bits */
#define LCD_F_CSSEL1_CSS48_OFS                   (16)                            /*!< LCDCSS48 Bit Offset */
#define LCD_F_CSSEL1_CSS48                       ((uint32_t)0x00010000)          /*!< L48 Com Seg select */
/* LCD_F_CSSEL1[CSS49] Bits */
#define LCD_F_CSSEL1_CSS49_OFS                   (17)                            /*!< LCDCSS49 Bit Offset */
#define LCD_F_CSSEL1_CSS49                       ((uint32_t)0x00020000)          /*!< L49 Com Seg select */
/* LCD_F_CSSEL1[CSS50] Bits */
#define LCD_F_CSSEL1_CSS50_OFS                   (18)                            /*!< LCDCSS50 Bit Offset */
#define LCD_F_CSSEL1_CSS50                       ((uint32_t)0x00040000)          /*!< L50 Com Seg select */
/* LCD_F_CSSEL1[CSS51] Bits */
#define LCD_F_CSSEL1_CSS51_OFS                   (19)                            /*!< LCDCSS51 Bit Offset */
#define LCD_F_CSSEL1_CSS51                       ((uint32_t)0x00080000)          /*!< L51 Com Seg select */
/* LCD_F_CSSEL1[CSS52] Bits */
#define LCD_F_CSSEL1_CSS52_OFS                   (20)                            /*!< LCDCSS52 Bit Offset */
#define LCD_F_CSSEL1_CSS52                       ((uint32_t)0x00100000)          /*!< L52 Com Seg select */
/* LCD_F_CSSEL1[CSS53] Bits */
#define LCD_F_CSSEL1_CSS53_OFS                   (21)                            /*!< LCDCSS53 Bit Offset */
#define LCD_F_CSSEL1_CSS53                       ((uint32_t)0x00200000)          /*!< L53 Com Seg select */
/* LCD_F_CSSEL1[CSS54] Bits */
#define LCD_F_CSSEL1_CSS54_OFS                   (22)                            /*!< LCDCSS54 Bit Offset */
#define LCD_F_CSSEL1_CSS54                       ((uint32_t)0x00400000)          /*!< L54 Com Seg select */
/* LCD_F_CSSEL1[CSS55] Bits */
#define LCD_F_CSSEL1_CSS55_OFS                   (23)                            /*!< LCDCSS55 Bit Offset */
#define LCD_F_CSSEL1_CSS55                       ((uint32_t)0x00800000)          /*!< L55 Com Seg select */
/* LCD_F_CSSEL1[CSS56] Bits */
#define LCD_F_CSSEL1_CSS56_OFS                   (24)                            /*!< LCDCSS56 Bit Offset */
#define LCD_F_CSSEL1_CSS56                       ((uint32_t)0x01000000)          /*!< L56 Com Seg select */
/* LCD_F_CSSEL1[CSS57] Bits */
#define LCD_F_CSSEL1_CSS57_OFS                   (25)                            /*!< LCDCSS57 Bit Offset */
#define LCD_F_CSSEL1_CSS57                       ((uint32_t)0x02000000)          /*!< L57 Com Seg select */
/* LCD_F_CSSEL1[CSS58] Bits */
#define LCD_F_CSSEL1_CSS58_OFS                   (26)                            /*!< LCDCSS58 Bit Offset */
#define LCD_F_CSSEL1_CSS58                       ((uint32_t)0x04000000)          /*!< L58 Com Seg select */
/* LCD_F_CSSEL1[CSS59] Bits */
#define LCD_F_CSSEL1_CSS59_OFS                   (27)                            /*!< LCDCSS59 Bit Offset */
#define LCD_F_CSSEL1_CSS59                       ((uint32_t)0x08000000)          /*!< L59 Com Seg select */
/* LCD_F_CSSEL1[CSS60] Bits */
#define LCD_F_CSSEL1_CSS60_OFS                   (28)                            /*!< LCDCSS60 Bit Offset */
#define LCD_F_CSSEL1_CSS60                       ((uint32_t)0x10000000)          /*!< L60 Com Seg select */
/* LCD_F_CSSEL1[CSS61] Bits */
#define LCD_F_CSSEL1_CSS61_OFS                   (29)                            /*!< LCDCSS61 Bit Offset */
#define LCD_F_CSSEL1_CSS61                       ((uint32_t)0x20000000)          /*!< L61 Com Seg select */
/* LCD_F_CSSEL1[CSS62] Bits */
#define LCD_F_CSSEL1_CSS62_OFS                   (30)                            /*!< LCDCSS62 Bit Offset */
#define LCD_F_CSSEL1_CSS62                       ((uint32_t)0x40000000)          /*!< L62 Com Seg select */
/* LCD_F_CSSEL1[CSS63] Bits */
#define LCD_F_CSSEL1_CSS63_OFS                   (31)                            /*!< LCDCSS63 Bit Offset */
#define LCD_F_CSSEL1_CSS63                       ((uint32_t)0x80000000)          /*!< L63 Com Seg select */
/* LCD_F_ANMCTL[ANMEN] Bits */
#define LCD_F_ANMCTL_ANMEN_OFS                   ( 0)                            /*!< LCDANMEN Bit Offset */
#define LCD_F_ANMCTL_ANMEN                       ((uint32_t)0x00000001)          /*!< Enable Animation */
/* LCD_F_ANMCTL[ANMSTP] Bits */
#define LCD_F_ANMCTL_ANMSTP_OFS                  ( 1)                            /*!< LCDANMSTP Bit Offset */
#define LCD_F_ANMCTL_ANMSTP_MASK                 ((uint32_t)0x0000000E)          /*!< LCDANMSTP Bit Mask */
#define LCD_F_ANMCTL_ANMSTP0                     ((uint32_t)0x00000002)          /*!< ANMSTP Bit 0 */
#define LCD_F_ANMCTL_ANMSTP1                     ((uint32_t)0x00000004)          /*!< ANMSTP Bit 1 */
#define LCD_F_ANMCTL_ANMSTP2                     ((uint32_t)0x00000008)          /*!< ANMSTP Bit 2 */
#define LCD_F_ANMCTL_ANMSTP_0                    ((uint32_t)0x00000000)          /*!< T0 */
#define LCD_F_ANMCTL_ANMSTP_1                    ((uint32_t)0x00000002)          /*!< T0 to T1 */
#define LCD_F_ANMCTL_ANMSTP_2                    ((uint32_t)0x00000004)          /*!< T0 to T2 */
#define LCD_F_ANMCTL_ANMSTP_3                    ((uint32_t)0x00000006)          /*!< T0 to T3 */
#define LCD_F_ANMCTL_ANMSTP_4                    ((uint32_t)0x00000008)          /*!< T0 to T4 */
#define LCD_F_ANMCTL_ANMSTP_5                    ((uint32_t)0x0000000A)          /*!< T0 to T5 */
#define LCD_F_ANMCTL_ANMSTP_6                    ((uint32_t)0x0000000C)          /*!< T0 to T6 */
#define LCD_F_ANMCTL_ANMSTP_7                    ((uint32_t)0x0000000E)          /*!< T0 to T7 */
/* LCD_F_ANMCTL[ANMCLR] Bits */
#define LCD_F_ANMCTL_ANMCLR_OFS                  ( 7)                            /*!< LCDANMCLR Bit Offset */
#define LCD_F_ANMCTL_ANMCLR                      ((uint32_t)0x00000080)          /*!< Clear Animation Memory */
/* LCD_F_ANMCTL[ANMPRE] Bits */
